БухЭксп/Catalogs/CW_РеестрыНДС0ЗаписиРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0ЗаписиРеестра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложенияТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0СтатусыЗаписиРеестра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПриказа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_РеестрыНДС0СтатусыЗаписиРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеестрыНДС0СтатусыЗаписиРеестра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_РеестрыНДС0ЗаписиРеестра/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		
		ВыбраннаяФорма = "ФормаЭлемента";
		
		Если Параметры.Свойство("Ключ") Тогда
			Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
				ВыбраннаяФорма = "ФормаЭлементаРеестра";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;     
	
	Поля.Добавить("ПериодОтчета");
	Поля.Добавить("ПодтверждениеНДС");
	Поля.Добавить("ПриложениеПриказа");
	Поля.Добавить("ПриложениеРеестра");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  

	Если Данные.ПодтверждениеНДС = Перечисления.CW_РеестрыНДС0СтатусыЗаписиРеестра.Подтвержден Тогда
		ПодтверждениеНДС = "Подтвержден";
	Иначе
		ПодтверждениеНДС = "Не подтврежден";
	КонецЕсли;
	
	Представление = СокрЛП(Данные.ПриложениеПриказа) +" ("+Данные.ПриложениеРеестра+")"+ " за " + Формат(Данные.ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'")+ " / "+ПодтверждениеНДС;

КонецПроцедуры

Процедура УстановитьНумерациюСправочника() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписиРеестрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаписиРеестрОбъект.записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьИзменениеРеквитовОбъетов(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого ЗаписьРеестра из ПараметрыПроцедуры.Ссылки Цикл
		
		ЗаписьРеестраОбъект =  ЗаписьРеестра.ПолучитьОбъект();
		
		Для Каждого КлючЗначение из ПараметрыПроцедуры.ЗначенияРеквизитов Цикл
			ЗаписьРеестраОбъект[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;                                                         
		
		ЗаписьРеестраОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
